Visualization/src/XmlaEngine/log/read38.txt

Read:0
================================================================================
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><Execute xmlns="urn:schemas-microsoft-com:xml-analysis"><Command><Statement>SELECT Hierarchize(Union(Union(Union(CrossJoin({[Measures].[store_sales]}, {[time].[1997]}), CrossJoin({[Measures].[store_sales]}, {[time].[1998]})), Union(CrossJoin({[Measures].[store_cost]}, {[time].[1997]}), CrossJoin({[Measures].[store_cost]}, {[time].[1998]}))), Union(CrossJoin({[Measures].[unit_sales]}, {[time].[1997]}), CrossJoin({[Measures].[unit_sales]}, {[time].[1998]})))) ON columns, Hierarchize(Union(Union({([cust].[Allcusts], [store].[All stores])}, CrossJoin([cust].[Allcusts].[Mexico].Children, {[store].[All stores]})), CrossJoin([cust].[Allcusts].[USA].Children, {[store].[All stores]}))) ON rows FROM mySales</Statement></Command><Properties><PropertyList><AxisFormat>TupleFormat</AxisFormat><Format>Multidimensional</Format><Catalog>test</Catalog><DataSourceInfo>Local Analysis Server</DataSourceInfo></PropertyList></Properties></Execute></SOAP-ENV:Body></SOAP-ENV:Envelope>
